{
    "budget": "A plan for managing your income and expenses to achieve financial goals.",
    "investment": "Allocating money to assets with the expectation of future returns.",
    "savings": "Money set aside for future needs or emergencies.",
    "etf": "Exchange-Traded Fund - a type of investment fund that trades on stock exchanges like individual stocks.",
    "401k": "A retirement savings plan sponsored by an employer that allows employees to save and invest a portion of their paycheck.",
    "ira": "Individual Retirement Account - a tax-advantaged investment account for retirement savings.",
    "compound_interest": "Interest calculated on the initial principal and accumulated interest from previous periods.",
    "diversification": "Spreading investments across different assets to reduce risk.",
    "asset_allocation": "The process of dividing investments among different asset categories like stocks, bonds, and cash.",
    "emergency_fund": "A savings account set aside for unexpected expenses or financial emergencies.",
    "credit_score": "A numerical representation of your creditworthiness based on credit history.",
    "debt_to_income_ratio": "The percentage of monthly income that goes toward paying debts.",
    "net_worth": "The total value of assets minus total liabilities.",
    "inflation": "The rate at which the general level of prices for goods and services rises.",
    "roi": "Return on Investment - a measure of the efficiency of an investment.",
    "mutual_fund": "An investment vehicle made up of a pool of funds collected from many investors.",
    "bond": "A fixed income investment where you loan money to an entity that borrows funds for a defined period.",
    "stock": "A type of security that signifies ownership in a corporation and represents a claim on part of the corporation's assets and earnings.",
    "dividend": "A payment made by a corporation to its shareholders, usually as a distribution of profits.",
    "capital_gains": "The profit from the sale of an asset that was purchased at a lower price.",
    "tax_deduction": "An expense that can be subtracted from gross income to reduce taxable income.",
    "liquidity": "The degree to which an asset or security can be quickly bought or sold in the market.",
    "volatility": "A statistical measure of the dispersion of returns for a given security or market index.",
    "rebalancing": "The process of realigning the weightings of a portfolio of assets.",
    "expense_ratio": "The annual fee that all funds charge their shareholders.",
    "yield": "The income return on an investment, expressed as a percentage.",
    "annuity": "A financial product that pays out a fixed stream of payments to an individual.",
    "hedge": "An investment position intended to offset potential losses from another investment.",
    "leverage": "The use of borrowed money to increase the potential return of an investment.",
    "portfolio": "A collection of financial investments like stocks, bonds, commodities, cash, and cash equivalents.",
    "risk_tolerance": "The degree of variability in investment returns that an investor is willing to withstand."
}
  